mack-hx/2026-Ti/0.2/empty.syscfg
TIMER3.$name              = "SYSTEM_TIIM";
TIMER3.timerClkDiv        = 8;
TIMER3.timerPeriod        = "1 ms";
TIMER3.timerStartTimer    = true;
TIMER3.peripheral.$assign = "TIMA0";

UART1.$name                    = "UART_0";
UART1.enabledInterrupts        = ["BREAK_ERROR","CTS_DONE","DMA_DONE_RX","DMA_DONE_TX","EOT_DONE","FRAMING_ERROR","NOISE_ERROR","OVERRUN_ERROR","PARITY_ERROR","RX","RXD_NEG_EDGE","RXD_POS_EDGE","RX_TIMEOUT_ERROR","TX"];
UART1.interruptPriority        = "0";
UART1.peripheral.rxPin.$assign = "PA11";
UART1.peripheral.txPin.$assign = "PA10";
UART1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric3";
UART1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric4";

UART2.$name                            = "K230";
UART2.interruptPriority                = "2";
UART2.enabledInterrupts                = ["RX_TIMEOUT_ERROR"];
UART2.peripheral.$assign               = "UART1";
UART2.peripheral.rxPin.$assign         = "PA9";
UART2.peripheral.txPin.$assign         = "PA8";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric5";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";

UART3.$name                            = "x_bujin";
UART3.targetBaudRate                   = 115200;
UART3.rxTimeoutValue                   = 10;
UART3.interruptPriority                = "0";
UART3.enabledInterrupts                = ["BREAK_ERROR","CTS_DONE","DMA_DONE_RX","DMA_DONE_TX","EOT_DONE","FRAMING_ERROR","NOISE_ERROR","OVERRUN_ERROR","PARITY_ERROR","RX","RXD_NEG_EDGE","RXD_POS_EDGE","RX_TIMEOUT_ERROR","TX"];
UART3.peripheral.$assign               = "UART2";
UART3.peripheral.rxPin.$assign         = "PB16";
UART3.peripheral.txPin.$assign         = "PB15";
UART3.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric7";
UART3.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric8";

UART4.$name                            = "y_bujin";
UART4.rxTimeoutValue                   = 10;
UART4.targetBaudRate                   = 115200;
UART4.interruptPriority                = "1";
UART4.enabledInterrupts                = ["BREAK_ERROR","CTS_DONE","DMA_DONE_RX","DMA_DONE_TX","EOT_DONE","FRAMING_ERROR","NOISE_ERROR","OVERRUN_ERROR","PARITY_ERROR","RX","RXD_NEG_EDGE","RXD_POS_EDGE","RX_TIMEOUT_ERROR","TX"];
UART4.peripheral.rxPin.$assign         = "PB3";
UART4.peripheral.txPin.$assign         = "PB2";
UART4.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART4.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
UART4.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
ADC121.peripheral.$suggestSolution             = "ADC1";
ADC122.DMA_CHANNEL.peripheral.$suggestSolution = "DMA_CH0";
Board.peripheral.$suggestSolution              = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution     = "PA20";
Board.peripheral.swdioPin.$suggestSolution     = "PA19";
GPIO2.associatedPins[0].pin.$suggestSolution   = "PA28";
GPIO2.associatedPins[1].pin.$suggestSolution   = "PA31";
GPIO3.associatedPins[0].pin.$suggestSolution   = "PB4";
GPIO3.associatedPins[1].pin.$suggestSolution   = "PB5";
GPIO4.associatedPins[0].pin.$suggestSolution   = "PB6";
GPIO4.associatedPins[2].pin.$suggestSolution   = "PB23";
GPIO4.associatedPins[3].pin.$suggestSolution   = "PB27";
GPIO5.associatedPins[0].pin.$suggestSolution   = "PA12";
GPIO6.associatedPins[0].pin.$suggestSolution   = "PB18";
GPIO6.associatedPins[1].pin.$suggestSolution   = "PB17";
GPIO7.associatedPins[1].pin.$suggestSolution   = "PB24";
GPIO7.associatedPins[2].pin.$suggestSolution   = "PA22";
GPIO7.associatedPins[3].pin.$suggestSolution   = "PB1";
GPIO7.associatedPins[4].pin.$suggestSolution   = "PB21";
GPIO9.associatedPins[0].pin.$suggestSolution   = "PA14";
I2C2.peripheral.$suggestSolution               = "I2C1";
I2C2.peripheral.sclPin.$suggestSolution        = "PA17";
UART1.peripheral.$suggestSolution              = "UART0";
UART4.peripheral.$suggestSolution              = "UART3";
